title: newSigmaComm
id: ff9925c7-9d3b-49fa-a339-88b5ba65cc1d
status: experimental
description: Detects
references:
    - https://www.microsoft.com/en-us/security/blog/2022/06/13/the-many-lives-of-blackcat-ransomware/
author: Micah Babinski
date: 2022/12/04
tags:
    - attack.t1059
    - attack.t1204
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: 'newSigmaComm'
    condition: selection
falsepositives:
    - Unknown
level: high
