title: Suspicious Command Line Indicating BlackCat Execution
id: df69c374-327e-4146-acff-4a961bb1b755
status: experimental
description: Detects
references:
    - https://www.microsoft.com/en-us/security/blog/2022/06/13/the-many-lives-of-blackcat-ransomware/
author: Micah Babinski
date: 2022/12/04
tags:
    - attack.execution
    - attack.t1059
    - attack.t1204
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine: '--access-token'
    condition: selection
falsepositives:
    - Unknown
level: high
