title: Suspicious WebDAV LNK Execution
status: experimental
description: Detects possible execution via LNK file accessed on a WebDAV server.
references:
    - https://www.trellix.com/en-us/about/newsroom/stories/research/beyond-file-search-a-novel-method.html
    - https://micahbabinski.medium.com/search-ms-webdav-and-chill-99c5b23ac462
author: Micah Babinski
date: 2023/07/31
tags:
    - attack.execution
    - attack.t1059.001
    - attack.t1204
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        ParentImage|endswith: '\explorer.exe'
        Image|endswith:
            - '\wscript.exe'
            - '\cscript.exe'
            - '\cmd.exe'
    selection_cmd:
        CommandLine|contains: '\DavWWWRoot\'
    condition: all of selection_*
falsepositives:
    - Unknown
level: high
